// =======================================================================================
// middleware authenticate
// ---------------------------------------------------------------------------------------
// Middleware authenticate виконує роль «охоронця» приватних даних.
// Він перевіряє токени, сесію та користувача.
// Якщо перевірка успішна — доступ до колекції студентів відкривається.
// Якщо ні — користувач отримує відповідь з 401 Unauthorized.
// =======================================================================================
// middleware
//    Перевіряє cookies. Якщо немає — відмовляємо у доступі.
//    Шукає сесію: чи існує в базі сесія з таким токеном.
//    Перевіряє строк дії токена: якщо він прострочений — користувач має оновити сесію.
//    Шукає користувача: якщо сесія дійсна, але користувач у базі видалений — доступ також забороняється.
//    Додає користувача у req: після цього контролери зможуть отримати інформацію про нього (req.user).
// Таким чином кожен запит до приватних ресурсів проходить перевірку перед тим, як дійти до контролера.
// ---------------------------------------------------------------------------------------
// Перевіряє наявність кукі accessToken.
//    Якщо accessToken відсутній — повертає через createHttpError помилку зі статусом 401 і повідомленням 'Missing access token'.
//    Якщо присутній — шукає у базі даних сесію за цим токеном. Якщо така сесія відсутня — повертає через createHttpError помилку зі статусом 401 і повідомленням 'Session not found';
// Перевіряє, чи не прострочений access-токен.
//    Якщо прострочений — повертає через createHttpError помилку зі статусом 401 і повідомленням 'Access token expired';
// Шукає користувача, пов’язаного з цією сесією.
//    Якщо такий користувач не знайдено — повертає через createHttpError помилку зі статусом 401 без повідомлення;
// У разі успіху додає об’єкт знайденого користувача в req.user і викликає next().
// =======================================================================================

import createHttpError from 'http-errors';
import { Session } from '../models/session.js';
import { User } from '../models/user.js';

export const authenticate = async (req, res, next) => {
  // Отримуємо дані з кукі запиту
  const { sessionId, accessToken } = req.cookies;

  // Перевіряємо наявність кукі
  if (!sessionId || !accessToken) {
    throw createHttpError(401, 'Missing access token');
  }

  // Якщо все ок, шукаємо сесію
  const session = await Session.findOne({
    _id: sessionId,
    accessToken,
  });

  // Якщо такої сесії нема, повертаємо помилку
  if (!session) {
    throw createHttpError(401, 'Session not found');
  }

  // Перевіряємо термін дії access токена
  const isAccessTokenExpired = session.accessTokenValidUntil < new Date();

  // Якщо термін дії access токена закінчився
  if (isAccessTokenExpired) {
    throw createHttpError(401, 'Access token expired');
  }

  // Якщо з токеном все добре і сесія існує, шукаємо користувача
  const user = await User.findById(session.userId);

  // Якщо користувача не знайдено
  if (!user) {
    throw createHttpError(401);
  }

  // Якщо користувач існує, додаємо його до запиту
  req.user = user;

  // Передаємо управління далі
  next();
};
