// ==========================================================================================
// Маршрути для коригування користувача
// ==========================================================================================

// Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
import { Router } from 'express';

// Імпорт бібліотеки валідації
// import { celebrate } from 'celebrate';

// Імпорт схем валідації

// Імпорт контролерів
import { updateUserAvatar } from '../controllers/userController.js';

// Імпорт middleware перевірки аутентифікації
import { authenticate } from '../middleware/authenticate.js';

// Імпортуємо middleware
import { upload } from '../middleware/multer.js';

// Створення роутеру
const router = Router();

// ===========================================================================================
// PATCH /users/me/avatar - Зміна аватара користувача
// -------------------------------------------------------------------------------------------
router.patch(
  '/users/me/avatar',
  authenticate,
  // Додаємо перевірку файлу після авторизації, але до контролера
  // Метод single(fieldname) обробляє рівно один файл.
  // У запиті очікується поле з іменем, яке ви вказали ("avatar"), і Multer прикріплює цей файл до req.file.
  upload.single('avatar'),
  updateUserAvatar,
);
// ===========================================================================================

// Експорт роутера
export default router;
