// ===========================================================================================
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді.
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
import createHttpError from 'http-errors';

// Імпорт моделі користувача User
import { User } from '../models/user.js';

import { saveFileToCloudinary } from '../utils/saveFileToCloudinary.js';

// ===========================================================================================
// PATCH /users/me/avatar
// -------------------------------------------------------------------------------------------
// Маршрут, за яким можна змінювати аватар
// -------------------------------------------------------------------------------------------
export const updateUserAvatar = async (req, res) => {
  const { file, user } = req;
  // 1. Перевірка наявності файлу.
  // Якщо користувач не передав файл — повертаємо помилку 400 Bad Request.
  if (!file) {
    throw createHttpError(400, 'No file');
  }

  // 2. Виклик saveFileToCloudinary.
  // Функція завантажує зображення у Cloudinary і повертає об’єкт із даними про файл. У ньому є, зокрема:
  //    secure_url — безпечне посилання на зображення, яке можна використовувати на фронтенді.
  //    public_id — унікальний ідентифікатор файлу у Cloudinary.
  //    format, resource_type, bytes та інші службові поля.
  const result = await saveFileToCloudinary(file.buffer, user._id);

  // 3. Оновлення користувача.
  // Ми шукаємо користувача за його _id (береться з req.user._id, встановленого в процесі аутентифікації).
  // Далі виконуємо findOneAndUpdate, щоб записати нову адресу аватара у властивість avatar.
  // Опція { returnDocument: "after" } гарантує, що у змінну user потрапить уже оновлений об’єкт користувача.
  const updatedUser = await User.findOneAndUpdate(
    { _id: user._id },
    { avatar: result.secure_url },
    { returnDocument: 'after' },
  );

  console.log(`updatedUser`, updatedUser);

  // У відповідь клієнт отримує JSON з ключем url, де лежить новий аватар користувача.
  res.status(200).json({ url: updatedUser.avatar });
};
// ===========================================================================================

// ===========================================================================================
// У req.file зберігається такий об’єкт (для multer.memoryStorage()):
//    {
//       fieldname: 'avatar',
//       originalname: 'download.jpeg',
//       encoding: '7bit',
//       mimetype: 'image/jpeg',
//       size: 12345,
//       buffer: <Buffer ff d8 ff ...>
//    }
// -------------------------------------------------------------------------------------------
// fieldname — ключ поля у формі (multipart/form-data), яке містить файл.
// originalname — початкове ім’я файла, яке надіслав клієнт.
// encoding — спосіб кодування під час передавання (зазвичай 7bit).
// mimetype — визначений тип вмісту (наприклад, image/png, image/jpeg).
// size — фактичний розмір отриманого файлу.
// buffer — повний вміст файлу у вигляді Buffer (саме його передаватимемо далі у хмарне сховище).
// ===========================================================================================
