// Сервер

// Імпорт фреймворка для Node.js - Express - для створення веб-сервера.
// Він спрощує створення HTTP-серверів та REST API:
import express from 'express';
// Імпорт бібліотеки Helmet - для підвищення безпеки HTTP-заголовків
import helmet from 'helmet';
// Імпорт бібліотеки CORS - для дозволу запитів з інших джерел
import cors from 'cors';

// Імпорт та налаштування пакету для читання змінних оточення з файлу .env
import 'dotenv/config';
// Імпорт функції для підключення до бази даних MongoDB
import { connectMongoDB } from './db/connectMongoDB.js';

// Імпорт middleware для логування HTTP-запитів
import { logger } from './middleware/logger.js';
// Імпорт middleware для обробки неіснуючих маршрутів
import { notFoundHandler } from './middleware/notFoundHandler.js';
// Імпорт middleware для обробки помилок
import { errorHandler } from './middleware/errorHandler.js';

// Імпорт роутера з маршрутами
import notesRoutes from './routes/notesRoutes.js';

// Створення екземпляру Express-додатку
const app = express();

// Використовуємо значення з .env (process.env.PORT) або дефолтний порт 3000
const PORT = process.env.PORT ?? 3000;

// ===========================================================================================
// Глобальні middleware - застосовуються до всіх маршрутів і запитів, які приходять на сервер
// ===========================================================================================
// Підключення та налаштування - Логування запитів
app.use(logger);

// Підключення та налаштування - Helmet - для підвищення безпеки HTTP-заголовків
app.use(helmet());

// express.json() - для парсингу JSON. Воно автоматично парсить (розпаковує) тіло HTTP-запиту,
// якщо воно надійшло у форматі JSON, і додає його у req.body.
app.use(
  express.json({
    type: ['application/json', 'application/vnd.api+json'], // Додаткові типи (за потреби)
    limit: '100kb', // Обмеження розмілу тіла - максимум 100 кілобайт
  }),
);

// Дозволяє запити з будь-яких джерел
app.use(
  cors({
    methods: ['GET', 'POST', 'PATCH', 'DELETE'], // дозволені HTTP-методи
    origin: '*', // дозволяє запити з будь-якого джерела (можна обмежити до конкретних доменів)
  }),
);
// ===========================================================================================

// ===========================================================================================
// Маршрути - визначають, як сервер відповідає на різні HTTP-запити
// (GET, POST, PUT, DELETE) до певних URL-шляхів.
// ===========================================================================================
// Підключення роутера з групою маршрутів
app.use(notesRoutes);
// ===========================================================================================

// ===========================================================================================
// Middleware 404 - для неіснуючих маршрутів
// ===========================================================================================
// Підключається після всіх маршрутів, але перед middleware для обробки помилок.
// Якщо жоден із маршрутів не збігся, керування дійде сюди.
app.use(notFoundHandler);
// ===========================================================================================

// ===========================================================================================
// Middleware для обробки помилок - має бути останнім після всіх маршрутів та інших middleware.
// ===========================================================================================
app.use(errorHandler);
// ===========================================================================================

// ===========================================================================================
// Викликаємо функцію для підключення до MongoDB перед запуском сервера
await connectMongoDB();
// ===========================================================================================

// ===========================================================================================
// Запуск сервера - прослуховування вказаного порту
app.listen(PORT, () => {
  console.log(`Server is running on port ${PORT}`);
});
// ===========================================================================================
